[{
		"company": "Google X",
		"tenure": "02/18 - Present",
		"title": "Software Engineer",
		"snippet": "Lending a helping hand and 20% of my time to get a moonshot off the ground.",
		"skills": [
			"C++",
			"JavaScript",
			"HTML",
			"CSS"
		],
		"frameworks": [
			"Blaze",
			"Protobuffers",
			"RPC"
		],
		"description": [
			[
				"Helped modernize the frontend for an ML visualization tool. This involved improving load",
				"time, browser compatibility, and adding much needed features to visualize models."
			]
		],
		"link" : "/experience?job=googlex",
		"urlname" : "googlex",
		"bannerurl": "/projects/googlex.png",
		"location" : "Mountain View, CA"
	},
	{
		"company": "Google - Gboard",
		"tenure": "09/16 - Present",
		"title": "iOS Software Engineer",
		"snippet": "Figuring out how you can share emojis faster, and how to type without hitting that pesky backspace.",
		"skills": [
			"Objective-C",
			"Objective-C++",
			"Python",
			"SQL",
			"C++",
			"Swift"
		],
		"frameworks": [
			"iOS",
			"Xcode",
			"hg (Mercurial)",
			"Protobuffers",
			"Blaze",
			"Sketch",
			"iTunes Connect"
		],
		"description": [
			[
				"I owned the expression portion of the keyboard (emojis, GIFs, etc.) for 8 months. During",
				"that time, I led a large scale refactor to reduce shared state and increase modularity. The",
				"resulting architecture allowed for simulataneous, independent development on different",
				"corpuses without risk of cross contamination or regressions. This architecture strongly",
				"resembles the springboard architecture which iOS uses to control the lifecycle of apps.",
				"The expression portion of the keyboard is unequivocally the most used portion of the",
				"keyboard outside of core input, so ensuring it's quick load times and code stability was my",
				"main objective."
			],
			[
				"After stabilizing expressions, I worked tirelessly on improving typing performance. I made",
				"significant contributions to typing quality, including reducing the \"bad autocorrect\"",
				"ratio by 8%. I also spent a lot of time on core input performance, including reducing",
				"the amount of drawable views in the view hierarchy, reducing performance bottlenecks, and",
				"developing a framework for executing asynchronous NSOperations."
			],
			[
				"I built out a platform for analyzing metrics and usage statistics. My platform executes a",
				"series of scripts each morning which aggregate anonymous user data into a digestable",
				"format. These metrics are then shown in a series of dashboards. After developing the",
				"platform, I educated team members on creating their own dashboards and identifying",
				"actionable metrics."
			],
			[
				"Recently, I created a modular architecture that queries multiple data sources for searching",
				"expressive content. Each data source is responsible for fetching relevant results for a",
				"query and returning them using a delegate-based system. The data sources also determine the",
				"appearance of the content, and it is shown in a UICollectionView with a custom layout. The",
				"modularity allows for independent development and testing which has improved stability.",
				"The modularity also allows for easy experimentation, and synchornization with the",
				"expression corpuses availability."
			]
		],
		"link" : "/experience?job=gboard",
		"urlname" : "gboard",
		"bannerurl" : "/projects/google-banner.png",
		"location" : "Mountain View, CA"
	}, {
		"company": "Visa Inc.",
		"tenure": "06/15 - 09/16",
		"title": "iOS Software Engineer",
		"snippet": "Reducing your go-to-market time, modernizing your sales tools, and developing payment technologies of tomorrow.",
		"skills": [
			"Swift",
			"Objective-C",
			"Python",
			"Node.js",
			"TVML",
			"React.js"
		],
		"frameworks": [
			"iOS",
			"Xcode",
			"Git",
			"iTunes Connect",
			"tvOS",
			"Illustrator",
			"Webpack",
			"HockeyApp"
		],
		"description": [
			[
				"I worked on the Global Mobile Point of Sale team and focused mainly on building out proof",
				"of concepts for global markets. I focused on mobile payments for emerging markets like",
				"India and Kenya. The main product that I worked on was mVisa, a mPOS solution to enable",
				"card based payments with nothing more than a smartphone. I worked on the original prototype",
				"for mVisa, using Parse's HTTP API that was abstracted out to use another backend if",
				"necessary. The prototype featured a consumer facing app, a merchant app, and a shared",
				"framework for core functionality such as pinging the network, or serializing transaction",
				"data. I was brought in as one of two iOS engineers to develop the official SDK as well as",
				"work on a core set of UI components with Visa branding."
			],
			[
				"My largest contribution at Visa was building out their enterprise app platform. As Visa",
				"started testing apps internally, conventional beta testing methods such as TestFlight",
				"became infeasible, especially due of the limits on the number of internal users. Instead,",
				"Visa used an enterprise certificate to sign apps. I modernized the process by taking an IPA",
				"or archive, changed the bundle id, updated metadata, and resigned it using the enterprise",
				"cert. It was then uploaded to our enterprise app hosting website where internal users could",
				"download it. This whole process took less than 3 minutes, and it reduced our release time",
				"for internal and App Store apps by nearly 2 days."
			],
			[
				"During my time, I also was the lead engineer on modernizing PerformSource, which is a sales",
				"tool used to sell purchasing cards to businesses for work expenses. The app was originally",
				"written using the iOS 5 SDK, and wasn't using ARC, Auto-Layout, and featured a skeumorphic",
				"UI that just didn't fit Visa's branding guidelines. With the introduction of the 12.9\"",
				"iPad Pro, I was given just 8 weeks to redo the app inside and out. This meant converting",
				"all of the code to use ARC and Auto-Layout, and look pretty on every iPad - just not the",
				"9.7\". I worked closely with the designers and product owner to deliver a high quality",
				"experience that clients loved."
			],
			[
				"Lastly, I was able to experiment a lot with Visa Checkout, Visa's flagship online payment",
				"service. During my time, I was able to demo Visa Checkout as a P2P solution, as well as",
				"recreate it on the Apple TV."
			]
		],
		"link" : "/experience?job=visa",
		"urlname" : "visa",
		"bannerurl": "/projects/visa-banner.png",
		"location" : "San Francisco, CA"
	}
]
