[
  {
    "name" : "Google X",
    "employer" : "Google X",
    "type" : "20% Project",
    "date" : "02/18 - Present",
    "languages" : [
      "C++",
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "frameworks" : [
      "Blaze",
      "Flume",
      "Protobuffers",
      "S2 - Google Maps"
    ],
    "image_url" : "/projects/googlex.png",
    "round_corners" : false,
    "snippet" : "Helped modernize the front end for a new moonshot at Google X.",
    "link" : "/projects?project=googlex",
    "urlname" : "googlex",
    "external_link" : "https://x.company/",
    "description" : [
      [
        "Helped modernize the frontend for an ML visualization tool. This involved improving load",
  			"time, browser compatibility, and adding much needed features to visualize models."
      ]
    ]
  },
  {
    "name" : "Pacman AI",
    "employer" : "",
    "type" : "Personal Project",
    "date" : "11/17 - Present",
    "languages" : [
      "Python",
      "Objective-C++",
      "C++",
      "Swift"
    ],
    "frameworks" : [
      "TensorFlow",
      "macOS",
      "git"
    ],
    "image_url" : "/projects/pacman.png",
    "round_corners" : false,
    "snippet" : "Trained a vision and OCR model to recognize the game board.",
    "link" : "/projects?project=pacman",
    "urlname" : "pacman",
    "external_link" : "https://github.com/jackarendt/pacman-ai",
    "description" : [
      [
        "After taking multiple online courses on machine learning, I set out to create my own ML",
  			"project. This project started because of a disagreement I had with my girlfriend about",
        "what was the optimal strategy when playing Pacman."
      ],
      [
        "My main goal was to be able to train and run Pacman on my 12\" MacBook. The computer didn't",
        "have fans, nor a dedicated GPU, so training a model quickly and having efficient inference",
        "was paramount. My initial approach was to split the game board up into 28x36 tiles",
        "consisting of 8x8 tiles. I chose this method to reduce the number of features that would in",
        "feed in to my model. By determining each tile individually, I was able to reduce the number",
        "of inputs from 193,000 (224 * 288 * 3) to 1008."
      ],
      [
        "I wrote a macOS app to launch Pacman on an emulator (OpenEmu), and take a screenshot of the",
        "game window 11 times, per second. After processing the image and resizing it, I run a",
        "tiling algorithm to split the 224x288 image into 1008 8x8 images. From there, the 1008",
        "images would be classified into 14 different classes. The inference was all done in C++",
        "using TensorFlow. From there, I would pass my 1008 classified tiles to my RL agent.",
        "Currently, I have an overall F1 score of 0.96, and I'm currently in the process of",
        "designing the RL agent. However I'm leaning towards a DQN using experience replay."
      ],
      [
        "One benefit of using window sliding was that I was easily able to create an OCR model. The",
        "OCR model required half as many images to train as the tile classifier model, and has an",
        "overall F1 score of 0.99."
      ],
      [
        "In retrospect, I would have used a ConvNet to reduce my feature space instead of tiling,",
        "but doing so taught me a lot about vision and building efficient infrastructure around my",
        "ML code. I also learned an extremely painful lesson during training: Have consistent",
        "labels. As I started classifying, my internal rules for what was a wall, what was a ghost,",
        "and what was just a mainly blank tile changed frequently. With the OCR model I ran into",
        "problems when classfiying 0's or O's. Reclassfiying the tiles by hand took a lot of time,",
        "and was a constant source of frustration. I look forward to finishing my agent, and using",
        "the new strategies to beat my friends at Pacman."
      ]
    ]
  },
  {
    "name" : "Gboard",
    "employer" : "Google",
    "type" : "Full Time Job",
    "date" : "09/16 - Present",
    "languages" : [
      "Objective-C",
      "Objective-C++",
      "Python",
      "SQL",
      "C++",
      "Swift"
    ],
    "frameworks" : [
      "iOS",
      "Blaze",
      "Mercurial (hg)",
      "Earl Grey",
      "OCMock",
      "XCTest",
      "Sketch"
    ],
    "image_url" : "/projects/gboard.png",
    "round_corners" : true,
    "snippet" : "I rewrote the entire expression platform, and increased typing accuracy.",
    "link" : "/projects?project=gboard",
    "urlname" : "gboard",
    "external_link" : "https://itunes.apple.com/us/app/gboard/id1091700242?mt=8",
    "description" : [
        [
        "Gboard is a third party keyboard for iOS. I joined the team shortly after launch in",
        "September 2016. My main responsibility for Gboard is overseeing the development of the",
        "expressions portion of the keyboard (emojis, GIFs, etc.). During my time, I led a large",
        "rewrite of this part of keyboard to use modular components and views that resembled the",
        "architecture of the iOS Springboard. Using this architecture, I was able to independently",
        "develop, QA, and test without worrying about one component interfering with another. The old",
        "architecture was a single view controller, and shared a ton of state, even when it wasn't",
        "necessary. The new architecture has virtually no shared state, and has made development a",
        "breeze. Since launching the rewrite, two new expression components have been developed,",
        "and our launch velocity is now much higher than it was before the rewrite."
      ],
      [
        "During my time at Gboard, I also worked on improving the core typing experience. I started",
        "working on this in January 2018. I would mercilessly hunt down performance bottlenecks to",
        "improve our keyboard launch time and stability, as well as focus on reducing the view",
        "hierarchy, which in turn used less memory. I've recently been focusing on tuning our decoder",
        "to improve our autocorrection ratio, and reduce our backspace ratio."
      ],
      [
        "My largest community contribution was building a platform for monitoring our usage and",
        "statistics. My platform executes a series of scripts each morning which aggregate anonymous",
        "user data into a digestable format. These metrics are then shown in a series of dashboards.",
        "After developing the platform, I educated team members on how to create their own",
        "dashboards to help my coworkers identify actionable metrics."
      ]
    ]
  },
  {
    "name" : "Tallied",
    "employer" : "",
    "type" : "Consulting / Freelancing",
    "date" : "01/18 - 03/18",
    "languages" : [
      "Swift"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "Illustrator",
      "TestFlight"
    ],
    "image_url" : "/projects/tallied.png",
    "round_corners" : true,
    "snippet" : "I had 6 weeks to design, develop, and test a demo app for a business presentation.",
    "link" : "/projects?project=tallied",
    "urlname" : "tallied",
    "external_link" : "",
    "description" : [
      [
        "I was contracted initially to help consult with a business pitch, but ended up building a",
        "demo app for four undergrad students at Wheaton College. After multiple meetings over",
        "FaceTime, I opened up Illustrator and went through many design reviews until settling on",
        "a simple, yet effective UI. With just three weeks until the demo, I spent many late nights",
        "building a demo app that used app groups to mock a network connection between two apps.",
        "The UI was based on Apple's new card design, and was written in Swift. I used TestFlight",
        "to upload builds to the students, and was always available to talk and meet. The business",
        "pitch went extremely well with the four students earning second place."
      ]
    ]
  },
  {
    "name" : "PerformSource",
    "employer" : "Visa Inc.",
    "type" : "Full Time Job",
    "date" : "01/16 - 06/16",
    "languages" : [
      "Objective-C",
      "SQL"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "iTunes Connect"
    ],
    "image_url" : "/projects/performsource.png",
    "round_corners" : true,
    "snippet" : "I took an app that wasn't even using ARC and redesigned it inside and out.",
    "link" : "/projects?project=performsource",
    "urlname" : "performsource",
    "external_link" : "https://itunes.apple.com/us/app/visa-performsource-cost-savings-calculator-email-version/id533284288?mt=8",
    "description" : [
      [
        "PerformSource is a sales tool application to convince businesses to sign up for a",
        "purchasing card. The app mocked sales and expenditures data to show how much money could",
        "be saved by using a p-card over using checks. The app was initially contracted out and",
        "written in 2012. Fast forward to 2016, where the skeumorphic design and lack of modern",
        "features left a lot to be desired. My work was split into two phases. Phase one was",
        "gutting the insides and updating the code base. Phase two was updating the UI to be in",
        "compliance with Visa's new brand guidelines, and work with larger iPads."
      ],
      [
        "I started phase one by mercilessly hunting down all of the retain and release statements,",
        "and converting the whole app to use ARC. Also the code health was in poor shape, with many",
        "misspellings, and needless looping. I spent three weeks converting the codebase to use the",
        "iOS 9 SDK and setting up a maintenance plan."
      ],
      [
        "For phase two, I met with a few designers to help explain what the main user journeys were",
        "and what was most important when demoing this app. I then set out to start updating the UI",
        "to use Auto-layout and follow the new designs. About half way through, I realized that some",
        "of the designs weren't the correct screen size, and they had been designed for an arbitrary",
        "screen size. With no designers available, I fixed a few of the screens myself. After 6",
        "weeks of development, the new app worked on any iPad in any orientation, something that",
        "our clients had been asking for. The app was met with very positive marks, and we received",
        "a lot of great feedback from clients."
      ]
    ]
  },
  {
    "name" : "This Website",
    "employer" : "",
    "type" : "Personal Project",
    "date" : "03/18 - Present",
    "languages" : [
      "Python",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "frameworks" : [
      "Flask",
      "Git",
      "lxml",
      "Illustrator"
    ],
    "image_url" : "/img/logo.svg",
    "round_corners" : false,
    "snippet" : "My second crack at a personal website. This time it's server side rendered, and no bootstrap.",
    "link" : "/projects?project=website",
    "urlname" : "website",
    "external_link" : "https://github.com/jackarendt/website",
    "description" : [
      [
        "This is my second shot at a website, and this time I decided to make a dynamic website",
        "instead of a static website like my first version. I also decided to remove bootstrap, and",
        "actually learn CSS. I chose python/Flask as my language of choice mainly because I already",
        "knew Express.js and wanted a challenge. I'm using templates to render dynamic content such",
        "as this page and parts of my home page. I also use lxml to insert DOM nodes if a node needs",
        "additional customization. My website is hosted entirely on Google Cloud, with a lot of",
        "resources being stored on a Google Storage bucket. I designed the website using Pinterest",
        "to find inspiration on web design."
      ]
    ]
  },
  {
    "name" : "mVisa",
    "employer" : "Visa Inc.",
    "type" : "Full Time Job",
    "date" : "10/15 - 09/16",
    "languages" : [
      "Swift"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "CocoaPods",
      "Parse"
    ],
    "image_url" : "/projects/mvisa.png",
    "round_corners" : true,
    "snippet" : "I was an iOS engineer responsible for building out a customizable mPOS experience.",
    "link" : "/projects?project=mvisa",
    "urlname" : "mvisa",
    "external_link" : "https://www.visa.com.ng/pay-with-visa/featured-technologies/mvisa.html",
    "description" : [
      [
        "mVisa is a Mobile Point of Sale (mPOS) SDK that is used by many banks in India. Credit",
        "card terminals are expensive, and a lot of merchants don't own them. mVisa is an",
        "alternative to a credit card terminal, allowing users to pay using their phones. I worked",
        "on the original prototype which was written entirely in Swift. Since I was building both",
        "the merchant app and consumer app, I structured the app so that a lot of code was shared",
        "in a dynamic framework. This demo app was used to pitch to potential banks to integrate",
        "with mVisa. It used Parse as a backend, and relied heavily on push notifications to",
        "simulate a persistent connection."
      ],
      [
        "Later, I was brought on as one of two iOS engineers to build the official mVisa SDK. I",
        "worked mainly on the consumer SDK spending a lot of time optimizing performance, and",
        "working with designers. I also contributed to Visa's shared design components. Similar to",
        "Apple's UIKit, and Google's Material Design, Visa began out its own UI components that ",
        "could be shared in all of its apps. I built a lot of the components that dealt specifically",
        "with rendering debit and credit cards."
      ]
    ]
  },
  {
    "name" : "Sierra Valley",
    "employer" : "",
    "type" : "Personal Project",
    "date" : "11/15 - 04/16",
    "languages" : [
      "Swift"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "SpriteKit",
      "Illustrator"
    ],
    "image_url" : "/projects/sierravalley.svg",
    "round_corners" : true,
    "snippet" : "My first crack at a game, an infinite runner with an objective of climbing a mountain.",
    "link" : "/projects?project=sierravalley",
    "urlname" : "sierravalley",
    "external_link" : "https://github.com/jackarendt/sierra-valley",
    "description" : [
      [
        "My favorite games growing up were arcade games, especially racing games. When my family",
        "used to go out to eat, my parents would give my brother and me quarters to go play Cruisin'",
        "USA so they could talk in peace. Later, I would go on to play Midnight Club and Need for",
        "Speed all through middle and high school. In college, my go-to was Mario Kart (N64 only).",
        "Needless to say, I love racing games, so this was kind of always a dream for me. I didn't",
        "know where to start, so I just grabbed my computer and opened Illustrator. After a few",
        "weeks of messing around and sketching cars in my notebook, I finally started development.",
        "Inspired by No Man's Sky, I opted to make my game procedurally generated. Each game piece",
        "was rendered and selected on the fly based on the current difficulty level. This would",
        "make each time through the game different and new, but also made it a complete pain to",
        "debug. I used SpriteKit as my game engine, and carefully profiled performance to make sure",
        "my game ran smoothly. The game is more or less feature complete, but not on the App Store."
      ]
    ]
  },
  {
    "name" : "Odds Are",
    "employer" : "",
    "type" : "Personal Project",
    "date" : "01/15 - 08/15",
    "languages" : [
      "Swift"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "Parse",
      "Illustrator",
      "iTunes Connect"
    ],
    "image_url" : "/projects/oddsare.svg",
    "round_corners" : true,
    "snippet" : "I was the lead developer of a social media platform designed around daring your friends.",
    "link" : "/projects?project=oddsare",
    "urlname" : "oddsare",
    "external_link" : "",
    "description" : [
      [
        "Odds Are started as a design project for a class at UIUC. A few friends and I decided that",
        "our idea actually had a shot in the real world. It was an online version of Odds Are, which",
        "is a game that we all used to play to dare our friends to do things. When I was a senior,",
        "this was all the rage, and we decided to capitalize on the opportunity."
      ],
      [
        "The app was written entirely in Swift, and uses Parse as a backend. The app also leverages",
        "Facebook's Graph API and sign in. The app launched in July, 2015. This was my first large",
        "app, and it was met with immediate success. Without a marketing budget, we had over 1,000",
        "DAUs, and were generating social media buzz in our social media circles. I eventually",
        "discontinued the app after Parse announced its shutdown in early 2016. I learned a lot",
        "from the opportunity, especially how to manage a small team, and how to effectively reach",
        "your user base."
      ]
    ]
  },
  {
    "name" : "Pipeline",
    "employer" : "",
    "type" : "Personal Project",
    "date" : "12/14 - 02/15",
    "languages" : [
      "Objective-C"
    ],
    "frameworks" : [
      "iOS",
      "Git",
      "Illustrator",
      "iTunes Connect"
    ],
    "image_url" : "/projects/pipeline.png",
    "round_corners" : true,
    "snippet" : "A puzzle game modeled after \"Connect the Pipes.\" My first E2E game with no oversight.",
    "link" : "/projects?project=pipeline",
    "urlname" : "pipeline",
    "external_link" : "https://itunes.apple.com/pg/app/pipeline-a-pipe-based-maze-game/id961382659?mt=8",
    "description" : [
      [
        "Pipeline was my second app on the App Store, and the first app that I developed E2E. I",
        "developed the app over winter break 2014, as a way to make some side income for the spring",
        "semester. The app was written in Objective-C, and used Core Data as storage. I designed",
        "the whole thing using Illustrator, and designed all 96 levels. The app wasn't a commercial",
        "success like I had hoped, but my mom liked the game. I learned a lot in the process, and I",
        "actually felt like I understood iTunes Connect at this point."
      ]
    ]
  }
]
